ОДУПР/src/InformationRegisters/оду_СостояниеОбъектовОбмена/оду_СостояниеОбъектовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>оду_СостояниеОбъектовОбмена</name>
  <resources>
    <name>РежимОбмена</name>
    <type>
      <types>EnumRef.оду_РежимОбмена</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеОбмена</name>
    <type>
      <types>EnumRef.оду_СостоянияОбмена</types>
    </type>
  </resources>
  <resources>
    <name>ТипXMLОбъектаИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипXMLОбъектаПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаВыгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПриоритетОбмена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПриоритетОбъекта</name>
    <comment>С признаком</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПриоритетДопПризнака</name>
    <comment>Для выделение объекта: Реализация (ЕГАИС, ВЕТИС и тд)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерПопытки</name>
    <comment>Считает номер попытки выгрузки, отправки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СменаИсточникаПриеменикаПриРазрешенииКоллизий</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИДОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДБазыИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДБазыПриемник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ОДУПР/src/InformationRegisters/оду_СостояниеОбъектовОбмена/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ИДОбъекта) Тогда
		Если (Запись.РежимОбмена = оду_ОбщийПовтИсп.РежимВыгрузка() ИЛИ Запись.РежимОбмена = оду_ОбщийПовтИсп.РежимЗапросСсылки() ИЛИ Запись.РежимОбмена = оду_ОбщийПовтИсп.РежимЗапросДвижений())
				И ЗначениеЗаполнено(Запись.ТипXMLОбъектаИсточника)  Тогда
			Объект1С = пр_Общий.СсылкаПоТипXML(Запись.ТипXMLОбъектаИсточника, Запись.ИДОбъекта);
		ИначеЕсли  Запись.РежимОбмена = оду_ОбщийПовтИсп.РежимЗагрузка() И ЗначениеЗаполнено(Запись.ТипXMLОбъектаПриемника) Тогда 	
			Объект1С = пр_Общий.СсылкаПоТипXML(Запись.ТипXMLОбъектаПриемника, Запись.ИДОбъекта);
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры
